{"organizations": [], "uuid": "ecf1c3f75fbb18c1f82226a9869f01119df48443", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/05/02/105177920-IMG_6593.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/05/02/dr-oz-health-tech-advances-need-to-be-for-everyone-not-just-the-rich.html", "country": "US", "domain_rank": 767, "title": "Dr. Oz: We need to make life-saving health tech for everyone, not just for rich people", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-05-02T20:17:00.000+03:00", "replies_count": 0, "uuid": "ecf1c3f75fbb18c1f82226a9869f01119df48443"}, "author": "", "url": "https://www.cnbc.com/2018/05/02/dr-oz-health-tech-advances-need-to-be-for-everyone-not-just-the-rich.html", "ord_in_thread": 0, "title": "Dr. Oz: We need to make life-saving health tech for everyone, not just for rich people", "locations": [], "entities": {"persons": [{"name": "mehmet oz", "sentiment": "negative"}, {"name": "oz", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "columbia university", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "5 Hours Ago | 03:45\nDr. Mehmet Oz said Wednesday that health technology needs to help every social class and not just the wealthy.\nThe host of the Emmy Award-winning \"Dr. Oz Show\" appeared on CNBC to announce a partnership to launch a new smartwatch designed to monitor the elderly for heart failure.\n\"We don't need technology like this that just save[s] the rich people,\" he said in a \"Squawk Box\" interview. \"We need them to save everybody.\"\nThe wearable, called iBeat, has the capability to notify emergency medical technicians. It retails for $249. There is also a $20 per month monitoring fee. Source: iBeat Watch\nThe iBeat device is being introduced as something similar to Life Alert, which is designed to help senior citizens who have an at-home emergency. However, unlike Life Alert, Oz said users of iBeat do not have to press a button to alert authorities.\n\"A lot of people aren't awake when they hit the ground. They're dead, already,\" said Oz, a heart surgeon and professor of surgery at Columbia University. With the smartwatch, which uses medical-grade sensors, \"you don't have to press a button, it'll do it automatically; it'll start calling 911,\" he added.\nThe San Francisco-based company iBeat recently closed another $5.5 million in seed funding, bringing the total round to $10 million. Its investors include Kairos, 8VC, City Light Capital, Plug and Play Ventures and ChinaRock Capital Management. The company plans to use the money to prepare for its upcoming retail and consumer launch later this summer. Source: iBeat Watch\nThe push for another new smartwatch comes at a time when the market is already saturated with wearables, even in health care. The Apple Watch, Fitbit and other popular wearable trackers can monitor steps, heart rate and even sleep. And tech companies are in a race to produce smartwatches that can detect even more medical problems.\nThe features that make iBeat different from other widely popular consumer products is its longer battery life and its lack of \"bells and whistles,\" Oz said. \"It's there for one reason. It's there to save your life,\" he said.\nOz, who got his television start on Oprah Winfrey's show in 2004, has turned his easy-to-understand healthy living advice into a global media empire. But he's not without his critics who over the years have questioned the efficacy of the treatments he talks about on his show and how he uses his influence. Oz told NBC News in 2015 his show's purpose is \"not to talk about medicine\" but to discuss \"the good life.\" Sign Up for Our Newsletter Morning Squawk CNBC's before the bell news roundup SIGN UP NOW Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . ", "external_links": ["https://www.nbcnews.com/health/health-news/dr-oz-responds-critics-its-not-medical-show-n347101"], "published": "2018-05-02T20:17:00.000+03:00", "crawled": "2018-05-02T20:40:26.038+03:00", "highlightTitle": ""}