{"organizations": [], "uuid": "1f826f77cce04f3c168b0fe838c80d52303c312f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/02/28/105035137-GettyImages-921242230.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/05/02/yum-brands-1q-earnings-2018.html", "country": "US", "domain_rank": 767, "title": "Yum Brands to report earnings before the opening bell. Here's what to expect", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-05-02T13:59:00.000+03:00", "replies_count": 0, "uuid": "1f826f77cce04f3c168b0fe838c80d52303c312f"}, "author": "", "url": "https://www.cnbc.com/2018/05/02/yum-brands-1q-earnings-2018.html", "ord_in_thread": 0, "title": "Yum Brands to report earnings before the opening bell. Here's what to expect", "locations": [], "entities": {"persons": [], "locations": [{"name": "bristol", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "yum brands", "sentiment": "negative"}, {"name": "cnbc.com getty images people", "sentiment": "neutral"}, {"name": "kfc", "sentiment": "neutral"}, {"name": "taco bell and pizza hut", "sentiment": "none"}, {"name": "thomson reuters overall", "sentiment": "none"}, {"name": "dhl", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "streetaccount overall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A chicken shortage in the U.K. in February weighed heavily on KFC during the first quarter, dragging down same-store sales growth at its parent company, Yum Brands .\nWhile Yum outpaced analyst estimates on revenue and profit, sales at Pizza Hut and Taco Bell were not enough to buoy its same-store sales growth.\nAcross the three brands, sales at established restaurants rose 1 percent in the quarter, falling short of analyst expectations of 1.9 percent, according to StreetAccount.\nHere's how Yum performed in the first quarter:\nEarnings: 90 cents per share, adjusted, vs. 68 cents per share expected by Thomson Reuters Revenue: $1.37 billion vs. $1.09 billion expected by Thomson Reuters Overall same-store sales: Up 1 percent vs. up 1.9 percent, expected by StreetAccount Shares slipped more than 5 percent in trading Wednesday.\nSome KFC restaurants in the U.K. were forced to temporarily close in February because they ran out of chicken after its new delivery partner DHL was unable to fulfill deliveries.\nSame-store sales at KFC in the quarter were up 2 percent, weaker than the 2.6 percent analysts had forecast, according to StreetAccount.\n\"Adjusting for the impact of this, we estimate Yum same-store sales growth would have been 2 percent and KFC's same-store sales growth would have been 3 percent,\" David Gibbs, president and chief financial officer at Yum, said during the earnings conference call Wednesday.\nThe company expects to take an additional hit from the U.K. incident in the second quarter due to a decrease in marketing while some of its locations were shuttered.\nOn the call, Gibbs said the second quarter will be \"the worst quarter of the year, most likely.\"\nIn the quarter ended March 31, the company said net income rose to $433 million, or $1.27 per share, up from $280 million, or 77 cents per share, a year earlier.\nExcluding items, the company earned 90 cents per share, better than the 68 cents per share analysts in a Thomson Reuters survey had expected.\nThe company's revenue fell 3 percent to $1.37 billion, compared with $1.42 billion last year. Wall Street had expected revenue to be $1.09 billion, according to Thomson Reuters estimates.\n\"As we begin the second full year of our transformation journey, I'm pleased with our progress towards becoming a more focused, more franchised and more efficient company,\" CEO Greg Creed said in a statement Wednesday. \"We're maintaining all aspects of our full-year 2018 guidance and remain confident that this transformation is building a strong foundation for long-term growth and will deliver increased returns for our stakeholders.\"\nThe company reiterated its forecast that same-store sales will grow 2 to 3 percent this year and that net new unit growth will be 3 to 4 percent.\nAt this time last year, investors were calling for Yum to divest Pizza Hut. Instead, the company plowed $130 million into new equipment, technology and marketing. The chain also has been heavily discounting its pizza and even launched a new rewards program, to steal market share from competitors like Domino's Pizza and Papa John's.\nDespite the investment, Pizza Hut same-store sales were up 1 percent, missing the mark of 1.8 percent that analysts had expected.\n\"Pizza Hut is a global iconic brand and the recent same-store sales results are simply not acceptable,\" Creed said on the call.\nMeanwhile, Taco Bell beat expectations with growth of 1 percent. Analysts had forecast same-store sales growth of 0.8 percent for the quarter.\nWhile the launch of Nacho Fries created buzz, the popularity of this promotion, as well as other $1 value items, weighed heavily on margins during the quarter.\n\"I think the good news is that you know we're not a one-trick pony when it comes to value,\" Creed said on the call. \"We've got a lot of really smart plays around value.\"", "external_links": [], "published": "2018-05-02T13:59:00.000+03:00", "crawled": "2018-05-02T14:03:29.000+03:00", "highlightTitle": ""}