{"organizations": [], "uuid": "62c8135d70897f83dc97f781fc51f289f57bd8ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/05/02/105178816-GettyImages-828582804.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/05/03/why-trader-joes-sells-cheap-bananas.html", "country": "US", "domain_rank": 767, "title": "The surprising story behind Trader Joe's 19 cent bananas", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-05-03T16:34:00.000+03:00", "replies_count": 0, "uuid": "62c8135d70897f83dc97f781fc51f289f57bd8ac"}, "author": "", "url": "https://www.cnbc.com/2018/05/03/why-trader-joes-sells-cheap-bananas.html", "ord_in_thread": 0, "title": "The surprising story behind Trader Joe's 19 cent bananas", "locations": [], "entities": {"persons": [{"name": "joe", "sentiment": "negative"}, {"name": "andy butterton", "sentiment": "negative"}, {"name": "dan bane", "sentiment": "none"}, {"name": "bane", "sentiment": "none"}], "locations": [{"name": "reddit", "sentiment": "none"}, {"name": "sun city", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trader Joe's bananas, priced at 19 cents each , are famous for being one of the best deals at the retailer and have even been the topic of conversation on Reddit threads.\nBut the story behind the unique way the retailer sells its affordable bananas (by the piece, not by the pound) is not only surprising, it also teaches a valuable business lesson.\nIn a recent episode of the grocery chain's new five-installment podcast , \"Inside Trader Joe's,\" the company's chairman and CEO, Dan Bane, recalls that they used to sell bananas by the pound, \"like everybody else.\" Since they don't have scales in the store, they would weigh and pre-package them for customers, with the smallest bag you could buy containing around four or five bananas.\nBane remembers being in a Trader Joe's store when a conversation with a customer sparked the change in the way the produce is sold.\n\"I was watching [shoppers] in Sun City, [Arizona], which was near a retirement complex,\" he explains. \"Customer — nice little lady — customer comes up and she looks at all the packages but didn't put one in her cart. And so I asked her, I said, 'Ma'am, if you don't mind me asking, I saw you looking at the bananas but you didn't...put anything in your cart.'\n\"And she says to me, 'Sonny, I may not live to that fourth banana,'\" Dane recalls.\n\"And so we decided the next day we were going to sell individual bananas. And they've been 19 cents ever since,\" Bane says.\nIt's a brilliant lesson in business and in leadership: Listen to your customers.\nGetty Images And it's working for Trader Joe's. The brand has developed a loyal customer base, even inspiring fan accounts on Twitter. Last year, in Market Force Information's ranking of America's favorite grocery store chains, Trade Joe's ranked second (Publix Super Markets and Wegmans tied for first). And Trader Joe's ranked no. 1 in the \"cashier courtesy\" category, based on the study of 12,700 shoppers.\nMany other successful business leaders also prioritize listening to customers. Billionaire and CEO of Tesla Elon Musk has been known to respond to customers' complaints directly on Twitter, and Instant Pot CEO and founder Robert Wang previously claimed to have read nearly every single one of the reviews for his product on Amazon.\nWhen Jeff Bezos launched Amazon in 1995, his mission was to create \"Earth's most customer-centric company,\" according to the site, and that is also its goal today.\nEven billionaire Virgin Group founder Richard Branson makes sure to listen to the advice of his employees and customers, as he lives by the idea that you can get great advice from anyone, his daughter Holly Branson recently told CNBC Make It .\n\"If he is sitting on Virgin Atlantic he will sit and chat with the customers and ask, 'Do you have any advice for me? Do you have any tips? Is there anything you don't like today? What can I change?'\" she says. \"And he writes everything down and he will make sure he takes action on it.\"\nDon't miss: How this 32-year-old high school dropout built a business that sold to Target for $550 million\nshow chapters The 'new' Whole Foods vs. Trader Joe's: Which is cheaper? 12:49 PM ET Tue, 26 Sept 2017 | 01:21 Like this story? Like CNBC Make It on Facebook !", "external_links": ["https://www.traderjoes.com/digin/post/inside-tjs-podcast", "https://www.thepennyhoarder.com/food/what-to-buy-at-trader-joes/", "https://www.reddit.com/r/EatCheapAndHealthy/comments/6ws6e1/bananas_at_trader_joes_19_cents_each/", "https://www.marketforce.com/2017-market-research-on-americas-favorite-grocery-chains"], "published": "2018-05-03T16:34:00.000+03:00", "crawled": "2018-05-03T16:46:33.000+03:00", "highlightTitle": ""}